grevaillot/svd_tools/headers/STM32H743x/rtc.h
#pragma once 

/* --- RTC: RTC ----------------------------------------------------- */

/** @defgroup rtc_registers RTC Register
@{*/

/** RTC_RTC_TR The RTC_TR is the calendar time shadow register. This register must be written in initialization mode only. Refer to Calendar initialization and configuration on page9 and Reading the calendar on page10.This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_TR			MMIO32(RTC_BASE + 0x00)
/** RTC_RTC_DR The RTC_DR is the calendar date shadow register. This register must be written in initialization mode only. Refer to Calendar initialization and configuration on page9 and Reading the calendar on page10.This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_DR			MMIO32(RTC_BASE + 0x04)
/** RTC_RTC_CR RTC control register **/
#define RTC_RTC_CR			MMIO32(RTC_BASE + 0x08)
/** RTC_RTC_ISR This register is write protected (except for RTC_ISR[13:8] bits). The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_ISR			MMIO32(RTC_BASE + 0x0c)
/** RTC_RTC_PRER This register must be written in initialization mode only. The initialization must be performed in two separate write accesses. Refer to Calendar initialization and configuration on page9.This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_PRER			MMIO32(RTC_BASE + 0x10)
/** RTC_RTC_WUTR This register can be written only when WUTWF is set to 1 in RTC_ISR.This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_WUTR			MMIO32(RTC_BASE + 0x14)
/** RTC_RTC_ALRMAR This register can be written only when ALRAWF is set to 1 in RTC_ISR, or in initialization mode.This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_ALRMAR			MMIO32(RTC_BASE + 0x1c)
/** RTC_RTC_ALRMBR This register can be written only when ALRBWF is set to 1 in RTC_ISR, or in initialization mode.This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_ALRMBR			MMIO32(RTC_BASE + 0x20)
/** RTC_RTC_WPR RTC write protection register **/
#define RTC_RTC_WPR			MMIO32(RTC_BASE + 0x24)
/** RTC_RTC_SSR RTC sub second register **/
#define RTC_RTC_SSR			MMIO32(RTC_BASE + 0x28)
/** RTC_RTC_SHIFTR This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_SHIFTR			MMIO32(RTC_BASE + 0x2c)
/** RTC_RTC_TSTR The content of this register is valid only when TSF is set to 1 in RTC_ISR. It is cleared when TSF bit is reset. **/
#define RTC_RTC_TSTR			MMIO32(RTC_BASE + 0x30)
/** RTC_RTC_TSDR The content of this register is valid only when TSF is set to 1 in RTC_ISR. It is cleared when TSF bit is reset. **/
#define RTC_RTC_TSDR			MMIO32(RTC_BASE + 0x34)
/** RTC_RTC_TSSSR The content of this register is valid only when RTC_ISR/TSF is set. It is cleared when the RTC_ISR/TSF bit is reset. **/
#define RTC_RTC_TSSSR			MMIO32(RTC_BASE + 0x38)
/** RTC_RTC_CALR This register is write protected. The write access procedure is described in RTC register write protection on page9. **/
#define RTC_RTC_CALR			MMIO32(RTC_BASE + 0x3c)
/** RTC_RTC_TAMPCR RTC tamper and alternate function configuration register **/
#define RTC_RTC_TAMPCR			MMIO32(RTC_BASE + 0x40)
/** RTC_RTC_ALRMASSR This register can be written only when ALRAE is reset in RTC_CR register, or in initialization mode.This register is write protected. The write access procedure is described in RTC register write protection on page9 **/
#define RTC_RTC_ALRMASSR			MMIO32(RTC_BASE + 0x44)
/** RTC_RTC_ALRMBSSR This register can be written only when ALRBE is reset in RTC_CR register, or in initialization mode.This register is write protected.The write access procedure is described in Section: RTC register write protection. **/
#define RTC_RTC_ALRMBSSR			MMIO32(RTC_BASE + 0x48)
/** RTC_RTC_OR RTC option register **/
#define RTC_RTC_OR			MMIO32(RTC_BASE + 0x4c)
/** RTC_RTC_BKP0R RTC backup registers **/
#define RTC_RTC_BKP0R			MMIO32(RTC_BASE + 0x50)
/** RTC_RTC_BKP1R RTC backup registers **/
#define RTC_RTC_BKP1R			MMIO32(RTC_BASE + 0x54)
/** RTC_RTC_BKP2R RTC backup registers **/
#define RTC_RTC_BKP2R			MMIO32(RTC_BASE + 0x58)
/** RTC_RTC_BKP3R RTC backup registers **/
#define RTC_RTC_BKP3R			MMIO32(RTC_BASE + 0x5c)
/** RTC_RTC_BKP4R RTC backup registers **/
#define RTC_RTC_BKP4R			MMIO32(RTC_BASE + 0x60)
/** RTC_RTC_BKP5R RTC backup registers **/
#define RTC_RTC_BKP5R			MMIO32(RTC_BASE + 0x64)
/** RTC_RTC_BKP6R RTC backup registers **/
#define RTC_RTC_BKP6R			MMIO32(RTC_BASE + 0x68)
/** RTC_RTC_BKP7R RTC backup registers **/
#define RTC_RTC_BKP7R			MMIO32(RTC_BASE + 0x6c)
/** RTC_RTC_BKP8R RTC backup registers **/
#define RTC_RTC_BKP8R			MMIO32(RTC_BASE + 0x70)
/** RTC_RTC_BKP9R RTC backup registers **/
#define RTC_RTC_BKP9R			MMIO32(RTC_BASE + 0x74)
/** RTC_RTC_BKP10R RTC backup registers **/
#define RTC_RTC_BKP10R			MMIO32(RTC_BASE + 0x78)
/** RTC_RTC_BKP11R RTC backup registers **/
#define RTC_RTC_BKP11R			MMIO32(RTC_BASE + 0x7c)
/** RTC_RTC_BKP12R RTC backup registers **/
#define RTC_RTC_BKP12R			MMIO32(RTC_BASE + 0x80)
/** RTC_RTC_BKP13R RTC backup registers **/
#define RTC_RTC_BKP13R			MMIO32(RTC_BASE + 0x84)
/** RTC_RTC_BKP14R RTC backup registers **/
#define RTC_RTC_BKP14R			MMIO32(RTC_BASE + 0x88)
/** RTC_RTC_BKP15R RTC backup registers **/
#define RTC_RTC_BKP15R			MMIO32(RTC_BASE + 0x8c)
/** RTC_RTC_BKP16R RTC backup registers **/
#define RTC_RTC_BKP16R			MMIO32(RTC_BASE + 0x90)
/** RTC_RTC_BKP17R RTC backup registers **/
#define RTC_RTC_BKP17R			MMIO32(RTC_BASE + 0x94)
/** RTC_RTC_BKP18R RTC backup registers **/
#define RTC_RTC_BKP18R			MMIO32(RTC_BASE + 0x98)
/** RTC_RTC_BKP19R RTC backup registers **/
#define RTC_RTC_BKP19R			MMIO32(RTC_BASE + 0x9c)
/** RTC_RTC_BKP20R RTC backup registers **/
#define RTC_RTC_BKP20R			MMIO32(RTC_BASE + 0xa0)
/** RTC_RTC_BKP21R RTC backup registers **/
#define RTC_RTC_BKP21R			MMIO32(RTC_BASE + 0xa4)
/** RTC_RTC_BKP22R RTC backup registers **/
#define RTC_RTC_BKP22R			MMIO32(RTC_BASE + 0xa8)
/** RTC_RTC_BKP23R RTC backup registers **/
#define RTC_RTC_BKP23R			MMIO32(RTC_BASE + 0xac)
/** RTC_RTC_BKP24R RTC backup registers **/
#define RTC_RTC_BKP24R			MMIO32(RTC_BASE + 0xb0)
/** RTC_RTC_BKP25R RTC backup registers **/
#define RTC_RTC_BKP25R			MMIO32(RTC_BASE + 0xb4)
/** RTC_RTC_BKP26R RTC backup registers **/
#define RTC_RTC_BKP26R			MMIO32(RTC_BASE + 0xb8)
/** RTC_RTC_BKP27R RTC backup registers **/
#define RTC_RTC_BKP27R			MMIO32(RTC_BASE + 0xbc)
/** RTC_RTC_BKP28R RTC backup registers **/
#define RTC_RTC_BKP28R			MMIO32(RTC_BASE + 0xc0)
/** RTC_RTC_BKP29R RTC backup registers **/
#define RTC_RTC_BKP29R			MMIO32(RTC_BASE + 0xc4)
/** RTC_RTC_BKP30R RTC backup registers **/
#define RTC_RTC_BKP30R			MMIO32(RTC_BASE + 0xc8)
/** RTC_RTC_BKP31R RTC backup registers **/
#define RTC_RTC_BKP31R			MMIO32(RTC_BASE + 0xcc)

/**@}*/


/** @defgroup rtc_rtc_tr RTCTR The RTC_TR is the calendar time shadow register. This register must be written in initialization mode only. Refer to Calendar initialization and configuration on page9 and Reading the calendar on page10.This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/

/** RTC_RTC_TR_PM AM/PM notation **/
#define RTC_RTC_TR_PM		(1 << 22)

#define RTC_RTC_TR_HT_SHIFT		20
#define RTC_RTC_TR_HT_MASK		0x03
/** @defgroup rtc_rtc_tr_ht HT Hour tens in BCD format
@{*/
/**@}*/


