grevaillot/svd_tools/headers/STM32H743x/rtc.h
#define RTC_RTC_TR_HU_SHIFT		16
#define RTC_RTC_TR_HU_MASK		0x0f
/** @defgroup rtc_rtc_tr_hu HU Hour units in BCD format
@{*/
/**@}*/


#define RTC_RTC_TR_MNT_SHIFT		12
#define RTC_RTC_TR_MNT_MASK		0x07
/** @defgroup rtc_rtc_tr_mnt MNT Minute tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_TR_MNU_SHIFT		8
#define RTC_RTC_TR_MNU_MASK		0x0f
/** @defgroup rtc_rtc_tr_mnu MNU Minute units in BCD format
@{*/
/**@}*/


#define RTC_RTC_TR_ST_SHIFT		4
#define RTC_RTC_TR_ST_MASK		0x07
/** @defgroup rtc_rtc_tr_st ST Second tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_TR_SU_SHIFT		0
#define RTC_RTC_TR_SU_MASK		0x0f
/** @defgroup rtc_rtc_tr_su SU Second units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_dr RTCDR The RTC_DR is the calendar date shadow register. This register must be written in initialization mode only. Refer to Calendar initialization and configuration on page9 and Reading the calendar on page10.This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/


#define RTC_RTC_DR_YT_SHIFT		20
#define RTC_RTC_DR_YT_MASK		0x0f
/** @defgroup rtc_rtc_dr_yt YT Year tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_DR_YU_SHIFT		16
#define RTC_RTC_DR_YU_MASK		0x0f
/** @defgroup rtc_rtc_dr_yu YU Year units in BCD format
@{*/
/**@}*/


#define RTC_RTC_DR_WDU_SHIFT		13
#define RTC_RTC_DR_WDU_MASK		0x07
/** @defgroup rtc_rtc_dr_wdu WDU Week day units
@{*/
/**@}*/

/** RTC_RTC_DR_MT Month tens in BCD format **/
#define RTC_RTC_DR_MT		(1 << 12)

#define RTC_RTC_DR_MU_SHIFT		8
#define RTC_RTC_DR_MU_MASK		0x0f
/** @defgroup rtc_rtc_dr_mu MU Month units in BCD format
@{*/
/**@}*/


#define RTC_RTC_DR_DT_SHIFT		4
#define RTC_RTC_DR_DT_MASK		0x03
/** @defgroup rtc_rtc_dr_dt DT Date tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_DR_DU_SHIFT		0
#define RTC_RTC_DR_DU_MASK		0x0f
/** @defgroup rtc_rtc_dr_du DU Date units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_cr RTCCR RTC control register
@{*/

/** RTC_RTC_CR_ITSE timestamp on internal event enable **/
#define RTC_RTC_CR_ITSE		(1 << 24)
/** RTC_RTC_CR_COE Calibration output enable This bit enables the RTC_CALIB output **/
#define RTC_RTC_CR_COE		(1 << 23)

#define RTC_RTC_CR_OSEL_SHIFT		21
#define RTC_RTC_CR_OSEL_MASK		0x03
/** @defgroup rtc_rtc_cr_osel OSEL Output selection These bits are used to select the flag to be routed to RTC_ALARM output
@{*/
/**@}*/

/** RTC_RTC_CR_POL Output polarity This bit is used to configure the polarity of RTC_ALARM output **/
#define RTC_RTC_CR_POL		(1 << 20)
/** RTC_RTC_CR_COSEL Calibration output selection When COE=1, this bit selects which signal is output on RTC_CALIB. These frequencies are valid for RTCCLK at 32.768 kHz and prescalers at their default values (PREDIV_A=127 and PREDIV_S=255). Refer to Section24.3.15: Calibration clock output **/
#define RTC_RTC_CR_COSEL		(1 << 19)
/** RTC_RTC_CR_BKP Backup This bit can be written by the user to memorize whether the daylight saving time change has been performed or not. **/
#define RTC_RTC_CR_BKP		(1 << 18)
/** RTC_RTC_CR_SUB1H Subtract 1 hour (winter time change) When this bit is set outside initialization mode, 1 hour is subtracted to the calendar time if the current hour is not 0. This bit is always read as 0. Setting this bit has no effect when current hour is 0. **/
#define RTC_RTC_CR_SUB1H		(1 << 17)
/** RTC_RTC_CR_ADD1H Add 1 hour (summer time change) When this bit is set outside initialization mode, 1 hour is added to the calendar time. This bit is always read as 0. **/
#define RTC_RTC_CR_ADD1H		(1 << 16)
/** RTC_RTC_CR_TSIE Time-stamp interrupt enable **/
#define RTC_RTC_CR_TSIE		(1 << 15)
/** RTC_RTC_CR_WUTIE Wakeup timer interrupt enable **/
#define RTC_RTC_CR_WUTIE		(1 << 14)
/** RTC_RTC_CR_ALRBIE Alarm B interrupt enable **/
#define RTC_RTC_CR_ALRBIE		(1 << 13)
/** RTC_RTC_CR_ALRAIE Alarm A interrupt enable **/
#define RTC_RTC_CR_ALRAIE		(1 << 12)
/** RTC_RTC_CR_TSE timestamp enable **/
#define RTC_RTC_CR_TSE		(1 << 11)
/** RTC_RTC_CR_WUTE Wakeup timer enable **/
#define RTC_RTC_CR_WUTE		(1 << 10)
/** RTC_RTC_CR_ALRBE Alarm B enable **/
#define RTC_RTC_CR_ALRBE		(1 << 9)
/** RTC_RTC_CR_ALRAE Alarm A enable **/
#define RTC_RTC_CR_ALRAE		(1 << 8)
/** RTC_RTC_CR_FMT Hour format **/
#define RTC_RTC_CR_FMT		(1 << 6)
/** RTC_RTC_CR_BYPSHAD Bypass the shadow registers Note: If the frequency of the APB clock is less than seven times the frequency of RTCCLK, BYPSHAD must be set to 1. **/
#define RTC_RTC_CR_BYPSHAD		(1 << 5)
/** RTC_RTC_CR_REFCKON RTC_REFIN reference clock detection enable (50 or 60Hz) Note: PREDIV_S must be 0x00FF. **/
#define RTC_RTC_CR_REFCKON		(1 << 4)
/** RTC_RTC_CR_TSEDGE Time-stamp event active edge TSE must be reset when TSEDGE is changed to avoid unwanted TSF setting. **/
#define RTC_RTC_CR_TSEDGE		(1 << 3)

#define RTC_RTC_CR_WUCKSEL_SHIFT		0
#define RTC_RTC_CR_WUCKSEL_MASK		0x07
/** @defgroup rtc_rtc_cr_wucksel WUCKSEL Wakeup clock selection
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_isr RTCISR This register is write protected (except for RTC_ISR[13:8] bits). The write access procedure is described in RTC register write protection on page9.
@{*/

/** RTC_RTC_ISR_ITSF Internal tTime-stamp flag **/
#define RTC_RTC_ISR_ITSF		(1 << 17)
/** RTC_RTC_ISR_RECALPF Recalibration pending Flag The RECALPF status flag is automatically set to 1 when software writes to the RTC_CALR register, indicating that the RTC_CALR register is blocked. When the new calibration settings are taken into account, this bit returns to 0. Refer to Re-calibration on-the-fly. **/
#define RTC_RTC_ISR_RECALPF		(1 << 16)
/** RTC_RTC_ISR_TAMP3F RTC_TAMP3 detection flag This flag is set by hardware when a tamper detection event is detected on the RTC_TAMP3 input. It is cleared by software writing 0 **/
#define RTC_RTC_ISR_TAMP3F		(1 << 15)
/** RTC_RTC_ISR_TAMP2F RTC_TAMP2 detection flag This flag is set by hardware when a tamper detection event is detected on the RTC_TAMP2 input. It is cleared by software writing 0 **/
#define RTC_RTC_ISR_TAMP2F		(1 << 14)
/** RTC_RTC_ISR_TAMP1F RTC_TAMP1 detection flag This flag is set by hardware when a tamper detection event is detected on the RTC_TAMP1 input. It is cleared by software writing 0 **/
#define RTC_RTC_ISR_TAMP1F		(1 << 13)
/** RTC_RTC_ISR_TSOVF Time-stamp overflow flag This flag is set by hardware when a time-stamp event occurs while TSF is already set. This flag is cleared by software by writing 0. It is recommended to check and then clear TSOVF only after clearing the TSF bit. Otherwise, an overflow might not be noticed if a time-stamp event occurs immediately before the TSF bit is cleared. **/
#define RTC_RTC_ISR_TSOVF		(1 << 12)
/** RTC_RTC_ISR_TSF Time-stamp flag This flag is set by hardware when a time-stamp event occurs. This flag is cleared by software by writing 0. **/
#define RTC_RTC_ISR_TSF		(1 << 11)
/** RTC_RTC_ISR_WUTF Wakeup timer flag This flag is set by hardware when the wakeup auto-reload counter reaches 0. This flag is cleared by software by writing 0. This flag must be cleared by software at least 1.5 RTCCLK periods before WUTF is set to 1 again. **/
#define RTC_RTC_ISR_WUTF		(1 << 10)
/** RTC_RTC_ISR_ALRBF Alarm B flag This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm B register (RTC_ALRMBR). This flag is cleared by software by writing 0. **/
#define RTC_RTC_ISR_ALRBF		(1 << 9)
/** RTC_RTC_ISR_ALRAF Alarm A flag This flag is set by hardware when the time/date registers (RTC_TR and RTC_DR) match the Alarm A register (RTC_ALRMAR). This flag is cleared by software by writing 0. **/
#define RTC_RTC_ISR_ALRAF		(1 << 8)
/** RTC_RTC_ISR_INIT Initialization mode **/
#define RTC_RTC_ISR_INIT		(1 << 7)
/** RTC_RTC_ISR_INITF Initialization flag When this bit is set to 1, the RTC is in initialization state, and the time, date and prescaler registers can be updated. **/
#define RTC_RTC_ISR_INITF		(1 << 6)
/** RTC_RTC_ISR_RSF Registers synchronization flag This bit is set by hardware each time the calendar registers are copied into the shadow registers (RTC_SSRx, RTC_TRx and RTC_DRx). This bit is cleared by hardware in initialization mode, while a shift operation is pending (SHPF=1), or when in bypass shadow register mode (BYPSHAD=1). This bit can also be cleared by software. It is cleared either by software or by hardware in initialization mode. **/
#define RTC_RTC_ISR_RSF		(1 << 5)
/** RTC_RTC_ISR_INITS Initialization status flag This bit is set by hardware when the calendar year field is different from 0 (Backup domain reset state). **/
#define RTC_RTC_ISR_INITS		(1 << 4)
/** RTC_RTC_ISR_SHPF Shift operation pending This flag is set by hardware as soon as a shift operation is initiated by a write to the RTC_SHIFTR register. It is cleared by hardware when the corresponding shift operation has been executed. Writing to the SHPF bit has no effect. **/
#define RTC_RTC_ISR_SHPF		(1 << 3)
/** RTC_RTC_ISR_WUTWF Wakeup timer write flag This bit is set by hardware up to 2 RTCCLK cycles after the WUTE bit has been set to 0 in RTC_CR, and is cleared up to 2 RTCCLK cycles after the WUTE bit has been set to 1. The wakeup timer values can be changed when WUTE bit is cleared and WUTWF is set. **/
#define RTC_RTC_ISR_WUTWF		(1 << 2)
/** RTC_RTC_ISR_ALRBWF Alarm B write flag This bit is set by hardware when Alarm B values can be changed, after the ALRBE bit has been set to 0 in RTC_CR. It is cleared by hardware in initialization mode. **/
#define RTC_RTC_ISR_ALRBWF		(1 << 1)
/** RTC_RTC_ISR_ALRAWF Alarm A write flag This bit is set by hardware when Alarm A values can be changed, after the ALRAE bit has been set to 0 in RTC_CR. It is cleared by hardware in initialization mode. **/
#define RTC_RTC_ISR_ALRAWF		(1 << 0)

/**@}*/

