grevaillot/svd_tools/headers/STM32H743x/rtc.h
/** @defgroup rtc_rtc_prer RTCPRER This register must be written in initialization mode only. The initialization must be performed in two separate write accesses. Refer to Calendar initialization and configuration on page9.This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/


#define RTC_RTC_PRER_PREDIV_A_SHIFT		16
#define RTC_RTC_PRER_PREDIV_A_MASK		0x7f
/** @defgroup rtc_rtc_prer_prediv_a PREDIVA Asynchronous prescaler factor This is the asynchronous division factor: ck_apre frequency = RTCCLK frequency/(PREDIV_A+1)
@{*/
/**@}*/


#define RTC_RTC_PRER_PREDIV_S_SHIFT		0
#define RTC_RTC_PRER_PREDIV_S_MASK		0x7fff
/** @defgroup rtc_rtc_prer_prediv_s PREDIVS Synchronous prescaler factor This is the synchronous division factor: ck_spre frequency = ck_apre frequency/(PREDIV_S+1)
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_wutr RTCWUTR This register can be written only when WUTWF is set to 1 in RTC_ISR.This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/


#define RTC_RTC_WUTR_WUT_SHIFT		0
#define RTC_RTC_WUTR_WUT_MASK		0xffff
/** @defgroup rtc_rtc_wutr_wut WUT Wakeup auto-reload value bits When the wakeup timer is enabled (WUTE set to 1), the WUTF flag is set every (WUT[15:0] + 1) ck_wut cycles. The ck_wut period is selected through WUCKSEL[2:0] bits of the RTC_CR register When WUCKSEL[2] = 1, the wakeup timer becomes 17-bits and WUCKSEL[1] effectively becomes WUT[16] the most-significant bit to be reloaded into the timer. The first assertion of WUTF occurs (WUT+1) ck_wut cycles after WUTE is set. Setting WUT[15:0] to 0x0000 with WUCKSEL[2:0] =011 (RTCCLK/2) is forbidden.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_alrmar RTCALRMAR This register can be written only when ALRAWF is set to 1 in RTC_ISR, or in initialization mode.This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/

/** RTC_RTC_ALRMAR_MSK4 Alarm A date mask **/
#define RTC_RTC_ALRMAR_MSK4		(1 << 31)
/** RTC_RTC_ALRMAR_WDSEL Week day selection **/
#define RTC_RTC_ALRMAR_WDSEL		(1 << 30)

#define RTC_RTC_ALRMAR_DT_SHIFT		28
#define RTC_RTC_ALRMAR_DT_MASK		0x03
/** @defgroup rtc_rtc_alrmar_dt DT Date tens in BCD format.
@{*/
/**@}*/


#define RTC_RTC_ALRMAR_DU_SHIFT		24
#define RTC_RTC_ALRMAR_DU_MASK		0x0f
/** @defgroup rtc_rtc_alrmar_du DU Date units or day in BCD format.
@{*/
/**@}*/

/** RTC_RTC_ALRMAR_MSK3 Alarm A hours mask **/
#define RTC_RTC_ALRMAR_MSK3		(1 << 23)
/** RTC_RTC_ALRMAR_PM AM/PM notation **/
#define RTC_RTC_ALRMAR_PM		(1 << 22)

#define RTC_RTC_ALRMAR_HT_SHIFT		20
#define RTC_RTC_ALRMAR_HT_MASK		0x03
/** @defgroup rtc_rtc_alrmar_ht HT Hour tens in BCD format.
@{*/
/**@}*/


#define RTC_RTC_ALRMAR_HU_SHIFT		16
#define RTC_RTC_ALRMAR_HU_MASK		0x0f
/** @defgroup rtc_rtc_alrmar_hu HU Hour units in BCD format.
@{*/
/**@}*/

/** RTC_RTC_ALRMAR_MSK2 Alarm A minutes mask **/
#define RTC_RTC_ALRMAR_MSK2		(1 << 15)

#define RTC_RTC_ALRMAR_MNT_SHIFT		12
#define RTC_RTC_ALRMAR_MNT_MASK		0x07
/** @defgroup rtc_rtc_alrmar_mnt MNT Minute tens in BCD format.
@{*/
/**@}*/


#define RTC_RTC_ALRMAR_MNU_SHIFT		8
#define RTC_RTC_ALRMAR_MNU_MASK		0x0f
/** @defgroup rtc_rtc_alrmar_mnu MNU Minute units in BCD format.
@{*/
/**@}*/

/** RTC_RTC_ALRMAR_MSK1 Alarm A seconds mask **/
#define RTC_RTC_ALRMAR_MSK1		(1 << 7)

#define RTC_RTC_ALRMAR_ST_SHIFT		4
#define RTC_RTC_ALRMAR_ST_MASK		0x07
/** @defgroup rtc_rtc_alrmar_st ST Second tens in BCD format.
@{*/
/**@}*/


#define RTC_RTC_ALRMAR_SU_SHIFT		0
#define RTC_RTC_ALRMAR_SU_MASK		0x0f
/** @defgroup rtc_rtc_alrmar_su SU Second units in BCD format.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_alrmbr RTCALRMBR This register can be written only when ALRBWF is set to 1 in RTC_ISR, or in initialization mode.This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/

/** RTC_RTC_ALRMBR_MSK4 Alarm B date mask **/
#define RTC_RTC_ALRMBR_MSK4		(1 << 31)
/** RTC_RTC_ALRMBR_WDSEL Week day selection **/
#define RTC_RTC_ALRMBR_WDSEL		(1 << 30)

#define RTC_RTC_ALRMBR_DT_SHIFT		28
#define RTC_RTC_ALRMBR_DT_MASK		0x03
/** @defgroup rtc_rtc_alrmbr_dt DT Date tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_ALRMBR_DU_SHIFT		24
#define RTC_RTC_ALRMBR_DU_MASK		0x0f
/** @defgroup rtc_rtc_alrmbr_du DU Date units or day in BCD format
@{*/
/**@}*/

/** RTC_RTC_ALRMBR_MSK3 Alarm B hours mask **/
#define RTC_RTC_ALRMBR_MSK3		(1 << 23)
/** RTC_RTC_ALRMBR_PM AM/PM notation **/
#define RTC_RTC_ALRMBR_PM		(1 << 22)

#define RTC_RTC_ALRMBR_HT_SHIFT		20
#define RTC_RTC_ALRMBR_HT_MASK		0x03
/** @defgroup rtc_rtc_alrmbr_ht HT Hour tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_ALRMBR_HU_SHIFT		16
#define RTC_RTC_ALRMBR_HU_MASK		0x0f
/** @defgroup rtc_rtc_alrmbr_hu HU Hour units in BCD format
@{*/
/**@}*/

/** RTC_RTC_ALRMBR_MSK2 Alarm B minutes mask **/
#define RTC_RTC_ALRMBR_MSK2		(1 << 15)

#define RTC_RTC_ALRMBR_MNT_SHIFT		12
#define RTC_RTC_ALRMBR_MNT_MASK		0x07
/** @defgroup rtc_rtc_alrmbr_mnt MNT Minute tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_ALRMBR_MNU_SHIFT		8
#define RTC_RTC_ALRMBR_MNU_MASK		0x0f
/** @defgroup rtc_rtc_alrmbr_mnu MNU Minute units in BCD format
@{*/
/**@}*/

/** RTC_RTC_ALRMBR_MSK1 Alarm B seconds mask **/
#define RTC_RTC_ALRMBR_MSK1		(1 << 7)

#define RTC_RTC_ALRMBR_ST_SHIFT		4
#define RTC_RTC_ALRMBR_ST_MASK		0x07
/** @defgroup rtc_rtc_alrmbr_st ST Second tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_ALRMBR_SU_SHIFT		0
#define RTC_RTC_ALRMBR_SU_MASK		0x0f
/** @defgroup rtc_rtc_alrmbr_su SU Second units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_wpr RTCWPR RTC write protection register
@{*/


#define RTC_RTC_WPR_KEY_SHIFT		0
#define RTC_RTC_WPR_KEY_MASK		0xff
/** @defgroup rtc_rtc_wpr_key KEY Write protection key This byte is written by software. Reading this byte always returns 0x00. Refer to RTC register write protection for a description of how to unlock RTC register write protection.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_ssr RTCSSR RTC sub second register
@{*/


#define RTC_RTC_SSR_SS_SHIFT		0
#define RTC_RTC_SSR_SS_MASK		0xffff
/** @defgroup rtc_rtc_ssr_ss SS Sub second value SS[15:0] is the value in the synchronous prescaler counter. The fraction of a second is given by the formula below: Second fraction = (PREDIV_S - SS) / (PREDIV_S + 1) Note: SS can be larger than PREDIV_S only after a shift operation. In that case, the correct time/date is one second less than as indicated by RTC_TR/RTC_DR.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_shiftr RTCSHIFTR This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/

/** RTC_RTC_SHIFTR_ADD1S Add one second This bit is write only and is always read as zero. Writing to this bit has no effect when a shift operation is pending (when SHPF=1, in RTC_ISR). This function is intended to be used with SUBFS (see description below) in order to effectively add a fraction of a second to the clock in an atomic operation. **/
#define RTC_RTC_SHIFTR_ADD1S		(1 << 31)

#define RTC_RTC_SHIFTR_SUBFS_SHIFT		0
#define RTC_RTC_SHIFTR_SUBFS_MASK		0x7fff
/** @defgroup rtc_rtc_shiftr_subfs SUBFS Subtract a fraction of a second These bits are write only and is always read as zero. Writing to this bit has no effect when a shift operation is pending (when SHPF=1, in RTC_ISR). The value which is written to SUBFS is added to the synchronous prescaler counter. Since this counter counts down, this operation effectively subtracts from (delays) the clock by: Delay (seconds) = SUBFS / (PREDIV_S + 1) A fraction of a second can effectively be added to the clock (advancing the clock) when the ADD1S function is used in conjunction with SUBFS, effectively advancing the clock by: Advance (seconds) = (1 - (SUBFS / (PREDIV_S + 1))). Note: Writing to SUBFS causes RSF to be cleared. Software can then wait until RSF=1 to be sure that the shadow registers have been updated with the shifted time.
@{*/
/**@}*/


/**@}*/

