grevaillot/svd_tools/headers/STM32H743x/rtc.h
/** @defgroup rtc_rtc_tstr RTCTSTR The content of this register is valid only when TSF is set to 1 in RTC_ISR. It is cleared when TSF bit is reset.
@{*/

/** RTC_RTC_TSTR_PM AM/PM notation **/
#define RTC_RTC_TSTR_PM		(1 << 22)

#define RTC_RTC_TSTR_HT_SHIFT		20
#define RTC_RTC_TSTR_HT_MASK		0x03
/** @defgroup rtc_rtc_tstr_ht HT Hour tens in BCD format.
@{*/
/**@}*/


#define RTC_RTC_TSTR_HU_SHIFT		16
#define RTC_RTC_TSTR_HU_MASK		0x0f
/** @defgroup rtc_rtc_tstr_hu HU Hour units in BCD format.
@{*/
/**@}*/


#define RTC_RTC_TSTR_MNT_SHIFT		12
#define RTC_RTC_TSTR_MNT_MASK		0x07
/** @defgroup rtc_rtc_tstr_mnt MNT Minute tens in BCD format.
@{*/
/**@}*/


#define RTC_RTC_TSTR_MNU_SHIFT		8
#define RTC_RTC_TSTR_MNU_MASK		0x0f
/** @defgroup rtc_rtc_tstr_mnu MNU Minute units in BCD format.
@{*/
/**@}*/


#define RTC_RTC_TSTR_ST_SHIFT		4
#define RTC_RTC_TSTR_ST_MASK		0x07
/** @defgroup rtc_rtc_tstr_st ST Second tens in BCD format.
@{*/
/**@}*/


#define RTC_RTC_TSTR_SU_SHIFT		0
#define RTC_RTC_TSTR_SU_MASK		0x0f
/** @defgroup rtc_rtc_tstr_su SU Second units in BCD format.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_tsdr RTCTSDR The content of this register is valid only when TSF is set to 1 in RTC_ISR. It is cleared when TSF bit is reset.
@{*/


#define RTC_RTC_TSDR_WDU_SHIFT		13
#define RTC_RTC_TSDR_WDU_MASK		0x07
/** @defgroup rtc_rtc_tsdr_wdu WDU Week day units
@{*/
/**@}*/

/** RTC_RTC_TSDR_MT Month tens in BCD format **/
#define RTC_RTC_TSDR_MT		(1 << 12)

#define RTC_RTC_TSDR_MU_SHIFT		8
#define RTC_RTC_TSDR_MU_MASK		0x0f
/** @defgroup rtc_rtc_tsdr_mu MU Month units in BCD format
@{*/
/**@}*/


#define RTC_RTC_TSDR_DT_SHIFT		4
#define RTC_RTC_TSDR_DT_MASK		0x03
/** @defgroup rtc_rtc_tsdr_dt DT Date tens in BCD format
@{*/
/**@}*/


#define RTC_RTC_TSDR_DU_SHIFT		0
#define RTC_RTC_TSDR_DU_MASK		0x0f
/** @defgroup rtc_rtc_tsdr_du DU Date units in BCD format
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_tsssr RTCTSSSR The content of this register is valid only when RTC_ISR/TSF is set. It is cleared when the RTC_ISR/TSF bit is reset.
@{*/


#define RTC_RTC_TSSSR_SS_SHIFT		0
#define RTC_RTC_TSSSR_SS_MASK		0xffff
/** @defgroup rtc_rtc_tsssr_ss SS Sub second value SS[15:0] is the value of the synchronous prescaler counter when the timestamp event occurred.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_calr RTCCALR This register is write protected. The write access procedure is described in RTC register write protection on page9.
@{*/

/** RTC_RTC_CALR_CALP Increase frequency of RTC by 488.5 ppm This feature is intended to be used in conjunction with CALM, which lowers the frequency of the calendar with a fine resolution. if the input frequency is 32768 Hz, the number of RTCCLK pulses added during a 32-second window is calculated as follows: (512 * CALP) - CALM. Refer to Section24.3.12: RTC smooth digital calibration. **/
#define RTC_RTC_CALR_CALP		(1 << 15)
/** RTC_RTC_CALR_CALW8 Use an 8-second calibration cycle period When CALW8 is set to 1, the 8-second calibration cycle period is selected. Note: CALM[1:0] are stuck at 00; when CALW8= 1. Refer to Section24.3.12: RTC smooth digital calibration. **/
#define RTC_RTC_CALR_CALW8		(1 << 14)
/** RTC_RTC_CALR_CALW16 Use a 16-second calibration cycle period When CALW16 is set to 1, the 16-second calibration cycle period is selected.This bit must not be set to 1 if CALW8=1. Note: CALM[0] is stuck at 0 when CALW16= 1. Refer to Section24.3.12: RTC smooth digital calibration. **/
#define RTC_RTC_CALR_CALW16		(1 << 13)

#define RTC_RTC_CALR_CALM_SHIFT		0
#define RTC_RTC_CALR_CALM_MASK		0x1ff
/** @defgroup rtc_rtc_calr_calm CALM Calibration minus The frequency of the calendar is reduced by masking CALM out of 220 RTCCLK pulses (32 seconds if the input frequency is 32768 Hz). This decreases the frequency of the calendar with a resolution of 0.9537 ppm. To increase the frequency of the calendar, this feature should be used in conjunction with CALP. See Section24.3.12: RTC smooth digital calibration on page13.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_tampcr RTCTAMPCR RTC tamper and alternate function configuration register
@{*/

/** RTC_RTC_TAMPCR_TAMP3MF Tamper 3 mask flag **/
#define RTC_RTC_TAMPCR_TAMP3MF		(1 << 24)
/** RTC_RTC_TAMPCR_TAMP3NOERASE Tamper 3 no erase **/
#define RTC_RTC_TAMPCR_TAMP3NOERASE		(1 << 23)
/** RTC_RTC_TAMPCR_TAMP3IE Tamper 3 interrupt enable **/
#define RTC_RTC_TAMPCR_TAMP3IE		(1 << 22)
/** RTC_RTC_TAMPCR_TAMP2MF Tamper 2 mask flag **/
#define RTC_RTC_TAMPCR_TAMP2MF		(1 << 21)
/** RTC_RTC_TAMPCR_TAMP2NOERASE Tamper 2 no erase **/
#define RTC_RTC_TAMPCR_TAMP2NOERASE		(1 << 20)
/** RTC_RTC_TAMPCR_TAMP2IE Tamper 2 interrupt enable **/
#define RTC_RTC_TAMPCR_TAMP2IE		(1 << 19)
/** RTC_RTC_TAMPCR_TAMP1MF Tamper 1 mask flag **/
#define RTC_RTC_TAMPCR_TAMP1MF		(1 << 18)
/** RTC_RTC_TAMPCR_TAMP1NOERASE Tamper 1 no erase **/
#define RTC_RTC_TAMPCR_TAMP1NOERASE		(1 << 17)
/** RTC_RTC_TAMPCR_TAMP1IE Tamper 1 interrupt enable **/
#define RTC_RTC_TAMPCR_TAMP1IE		(1 << 16)
/** RTC_RTC_TAMPCR_TAMPPUDIS RTC_TAMPx pull-up disable This bit determines if each of the RTC_TAMPx pins are pre-charged before each sample. **/
#define RTC_RTC_TAMPCR_TAMPPUDIS		(1 << 15)

#define RTC_RTC_TAMPCR_TAMPPRCH_SHIFT		13
#define RTC_RTC_TAMPCR_TAMPPRCH_MASK		0x03
/** @defgroup rtc_rtc_tampcr_tampprch TAMPPRCH RTC_TAMPx precharge duration These bit determines the duration of time during which the pull-up/is activated before each sample. TAMPPRCH is valid for each of the RTC_TAMPx inputs.
@{*/
/**@}*/


#define RTC_RTC_TAMPCR_TAMPFLT_SHIFT		11
#define RTC_RTC_TAMPCR_TAMPFLT_MASK		0x03
/** @defgroup rtc_rtc_tampcr_tampflt TAMPFLT RTC_TAMPx filter count These bits determines the number of consecutive samples at the specified level (TAMP*TRG) needed to activate a Tamper event. TAMPFLT is valid for each of the RTC_TAMPx inputs.
@{*/
/**@}*/


#define RTC_RTC_TAMPCR_TAMPFREQ_SHIFT		8
#define RTC_RTC_TAMPCR_TAMPFREQ_MASK		0x07
/** @defgroup rtc_rtc_tampcr_tampfreq TAMPFREQ Tamper sampling frequency Determines the frequency at which each of the RTC_TAMPx inputs are sampled.
@{*/
/**@}*/

/** RTC_RTC_TAMPCR_TAMPTS Activate timestamp on tamper detection event TAMPTS is valid even if TSE=0 in the RTC_CR register. **/
#define RTC_RTC_TAMPCR_TAMPTS		(1 << 7)
/** RTC_RTC_TAMPCR_TAMP3TRG Active level for RTC_TAMP3 input if TAMPFLT != 00: if TAMPFLT = 00: **/
#define RTC_RTC_TAMPCR_TAMP3TRG		(1 << 6)
/** RTC_RTC_TAMPCR_TAMP3E RTC_TAMP3 detection enable **/
#define RTC_RTC_TAMPCR_TAMP3E		(1 << 5)
/** RTC_RTC_TAMPCR_TAMP2TRG Active level for RTC_TAMP2 input if TAMPFLT != 00: if TAMPFLT = 00: **/
#define RTC_RTC_TAMPCR_TAMP2TRG		(1 << 4)
/** RTC_RTC_TAMPCR_TAMP2E RTC_TAMP2 input detection enable **/
#define RTC_RTC_TAMPCR_TAMP2E		(1 << 3)
/** RTC_RTC_TAMPCR_TAMPIE Tamper interrupt enable **/
#define RTC_RTC_TAMPCR_TAMPIE		(1 << 2)
/** RTC_RTC_TAMPCR_TAMP1TRG Active level for RTC_TAMP1 input If TAMPFLT != 00 if TAMPFLT = 00: **/
#define RTC_RTC_TAMPCR_TAMP1TRG		(1 << 1)
/** RTC_RTC_TAMPCR_TAMP1E RTC_TAMP1 input detection enable **/
#define RTC_RTC_TAMPCR_TAMP1E		(1 << 0)

/**@}*/

/** @defgroup rtc_rtc_alrmassr RTCALRMASSR This register can be written only when ALRAE is reset in RTC_CR register, or in initialization mode.This register is write protected. The write access procedure is described in RTC register write protection on page9
@{*/


