grevaillot/svd_tools/headers/STM32H743x/rtc.h
#define RTC_RTC_ALRMASSR_MASKSS_SHIFT		24
#define RTC_RTC_ALRMASSR_MASKSS_MASK		0x0f
/** @defgroup rtc_rtc_alrmassr_maskss MASKSS Mask the most-significant bits starting at this bit ... The overflow bits of the synchronous counter (bits 15) is never compared. This bit can be different from 0 only after a shift operation.
@{*/
/**@}*/


#define RTC_RTC_ALRMASSR_SS_SHIFT		0
#define RTC_RTC_ALRMASSR_SS_MASK		0x7fff
/** @defgroup rtc_rtc_alrmassr_ss SS Sub seconds value This value is compared with the contents of the synchronous prescaler counter to determine if Alarm A is to be activated. Only bits 0 up MASKSS-1 are compared.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_alrmbssr RTCALRMBSSR This register can be written only when ALRBE is reset in RTC_CR register, or in initialization mode.This register is write protected.The write access procedure is described in Section: RTC register write protection.
@{*/


#define RTC_RTC_ALRMBSSR_MASKSS_SHIFT		24
#define RTC_RTC_ALRMBSSR_MASKSS_MASK		0x0f
/** @defgroup rtc_rtc_alrmbssr_maskss MASKSS Mask the most-significant bits starting at this bit ... The overflow bits of the synchronous counter (bits 15) is never compared. This bit can be different from 0 only after a shift operation.
@{*/
/**@}*/


#define RTC_RTC_ALRMBSSR_SS_SHIFT		0
#define RTC_RTC_ALRMBSSR_SS_MASK		0x7fff
/** @defgroup rtc_rtc_alrmbssr_ss SS Sub seconds value This value is compared with the contents of the synchronous prescaler counter to determine if Alarm B is to be activated. Only bits 0 up to MASKSS-1 are compared.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_or RTCOR RTC option register
@{*/

/** RTC_RTC_OR_RTC_OUT_RMP RTC_OUT remap **/
#define RTC_RTC_OR_RTC_OUT_RMP		(1 << 1)
/** RTC_RTC_OR_RTC_ALARM_TYPE RTC_ALARM output type on PC13 **/
#define RTC_RTC_OR_RTC_ALARM_TYPE		(1 << 0)

/**@}*/

/** @defgroup rtc_rtc_bkp0r RTCBKP0R RTC backup registers
@{*/


#define RTC_RTC_BKP0R_BKP_SHIFT		0
#define RTC_RTC_BKP0R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp0r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp1r RTCBKP1R RTC backup registers
@{*/


#define RTC_RTC_BKP1R_BKP_SHIFT		0
#define RTC_RTC_BKP1R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp1r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp2r RTCBKP2R RTC backup registers
@{*/


#define RTC_RTC_BKP2R_BKP_SHIFT		0
#define RTC_RTC_BKP2R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp2r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp3r RTCBKP3R RTC backup registers
@{*/


#define RTC_RTC_BKP3R_BKP_SHIFT		0
#define RTC_RTC_BKP3R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp3r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp4r RTCBKP4R RTC backup registers
@{*/


#define RTC_RTC_BKP4R_BKP_SHIFT		0
#define RTC_RTC_BKP4R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp4r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp5r RTCBKP5R RTC backup registers
@{*/


#define RTC_RTC_BKP5R_BKP_SHIFT		0
#define RTC_RTC_BKP5R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp5r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp6r RTCBKP6R RTC backup registers
@{*/


#define RTC_RTC_BKP6R_BKP_SHIFT		0
#define RTC_RTC_BKP6R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp6r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp7r RTCBKP7R RTC backup registers
@{*/


#define RTC_RTC_BKP7R_BKP_SHIFT		0
#define RTC_RTC_BKP7R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp7r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp8r RTCBKP8R RTC backup registers
@{*/


#define RTC_RTC_BKP8R_BKP_SHIFT		0
#define RTC_RTC_BKP8R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp8r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

