grevaillot/svd_tools/headers/STM32H743x/rtc.h
/** @defgroup rtc_rtc_bkp9r RTCBKP9R RTC backup registers
@{*/


#define RTC_RTC_BKP9R_BKP_SHIFT		0
#define RTC_RTC_BKP9R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp9r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp10r RTCBKP10R RTC backup registers
@{*/


#define RTC_RTC_BKP10R_BKP_SHIFT		0
#define RTC_RTC_BKP10R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp10r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp11r RTCBKP11R RTC backup registers
@{*/


#define RTC_RTC_BKP11R_BKP_SHIFT		0
#define RTC_RTC_BKP11R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp11r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp12r RTCBKP12R RTC backup registers
@{*/


#define RTC_RTC_BKP12R_BKP_SHIFT		0
#define RTC_RTC_BKP12R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp12r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp13r RTCBKP13R RTC backup registers
@{*/


#define RTC_RTC_BKP13R_BKP_SHIFT		0
#define RTC_RTC_BKP13R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp13r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp14r RTCBKP14R RTC backup registers
@{*/


#define RTC_RTC_BKP14R_BKP_SHIFT		0
#define RTC_RTC_BKP14R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp14r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp15r RTCBKP15R RTC backup registers
@{*/


#define RTC_RTC_BKP15R_BKP_SHIFT		0
#define RTC_RTC_BKP15R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp15r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp16r RTCBKP16R RTC backup registers
@{*/


#define RTC_RTC_BKP16R_BKP_SHIFT		0
#define RTC_RTC_BKP16R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp16r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp17r RTCBKP17R RTC backup registers
@{*/


#define RTC_RTC_BKP17R_BKP_SHIFT		0
#define RTC_RTC_BKP17R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp17r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp18r RTCBKP18R RTC backup registers
@{*/


#define RTC_RTC_BKP18R_BKP_SHIFT		0
#define RTC_RTC_BKP18R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp18r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp19r RTCBKP19R RTC backup registers
@{*/


#define RTC_RTC_BKP19R_BKP_SHIFT		0
#define RTC_RTC_BKP19R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp19r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp20r RTCBKP20R RTC backup registers
@{*/


#define RTC_RTC_BKP20R_BKP_SHIFT		0
#define RTC_RTC_BKP20R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp20r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp21r RTCBKP21R RTC backup registers
@{*/


#define RTC_RTC_BKP21R_BKP_SHIFT		0
#define RTC_RTC_BKP21R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp21r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp22r RTCBKP22R RTC backup registers
@{*/


#define RTC_RTC_BKP22R_BKP_SHIFT		0
#define RTC_RTC_BKP22R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp22r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp23r RTCBKP23R RTC backup registers
@{*/


#define RTC_RTC_BKP23R_BKP_SHIFT		0
#define RTC_RTC_BKP23R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp23r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp24r RTCBKP24R RTC backup registers
@{*/


#define RTC_RTC_BKP24R_BKP_SHIFT		0
#define RTC_RTC_BKP24R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp24r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp25r RTCBKP25R RTC backup registers
@{*/


#define RTC_RTC_BKP25R_BKP_SHIFT		0
#define RTC_RTC_BKP25R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp25r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp26r RTCBKP26R RTC backup registers
@{*/


