grevaillot/svd_tools/headers/STM32H743x/rtc.h
#define RTC_RTC_BKP26R_BKP_SHIFT		0
#define RTC_RTC_BKP26R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp26r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp27r RTCBKP27R RTC backup registers
@{*/


#define RTC_RTC_BKP27R_BKP_SHIFT		0
#define RTC_RTC_BKP27R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp27r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp28r RTCBKP28R RTC backup registers
@{*/


#define RTC_RTC_BKP28R_BKP_SHIFT		0
#define RTC_RTC_BKP28R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp28r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp29r RTCBKP29R RTC backup registers
@{*/


#define RTC_RTC_BKP29R_BKP_SHIFT		0
#define RTC_RTC_BKP29R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp29r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp30r RTCBKP30R RTC backup registers
@{*/


#define RTC_RTC_BKP30R_BKP_SHIFT		0
#define RTC_RTC_BKP30R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp30r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/

/** @defgroup rtc_rtc_bkp31r RTCBKP31R RTC backup registers
@{*/


#define RTC_RTC_BKP31R_BKP_SHIFT		0
#define RTC_RTC_BKP31R_BKP_MASK		0xffffffff
/** @defgroup rtc_rtc_bkp31r_bkp BKP The application can write or read data to and from these registers. They are powered-on by VBAT when VDD is switched off, so that they are not reset by System reset, and their contents remain valid when the device operates in low-power mode. This register is reset on a tamper detection event, as long as TAMPxF=1. or when the Flash readout protection is disabled.
@{*/
/**@}*/


/**@}*/
